///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие Из КлючЗначение:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Пример инициализации:
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Пример использования:
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

// Конец СтандартныеПодсистемы

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ОбработкаПолученияФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Обсуждения
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
	
		МодульОбсужденияСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбсужденияСлужебныйКлиент");
		МодульОбсужденияСлужебныйКлиент.ПриПолученииФормыВыбораПользователейСистемыВзаимодействия(НазначениеВыбора, Форма, ИдентификаторОбсуждения, Параметры, ВыбраннаяФорма, СтандартнаяОбработка);
	
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Обсуждения
		
КонецПроцедуры

#КонецОбласти

#Область Задание
//Домашнее задание к занятию "Командная работа (EDT)"
//Цель задания
//Используя EDT научиться работсать с 1С через систему контроля версий Git
//
//Чеклист готовности к домашнему заданию
// Установить платформу версии 8.3.25.
// Установить 1C:EDT актуальной версии
// Просмотреть материал занятия "Командная работа (EDT)".
//Задание 1
//Описание задачи
//Вам необходимо сделать fork удаленного репозитория на github и доработать его.
//
//Требования к результату
//Ссылка на репозиторий в Вашем аккаунте на github с доработанной конфигурацией.
//
//Процесс выполнения
//Перейдите к репозиторию с исходным кодом уже знакомой Вам конфигурации
//Создайте fork этого репозитория в своем аккаунте. Для этого Вы должны быть авторизованы в github, тогда в правом верхнем углу будет кнопка "Fork". Таким образом, вы создадите в своем аккаунте полную копию исходного репозитория.
//В EDT создайте новый проект.
//При помощи команды клонирования, склонируйте репозиторий в локальную папку.
//Выполните доработки конфигурации, описанные в прошлых заданиях. (обязательно, выполнить доработку из задания 11 модуля - вносите изменения непосредственно в код конфигурации, как во второй задаче, так же, если хотите, можете выполнить задачи 12 модуля)
//Подсказка 1
//При выполнении доработок, старайтесь коммитить в репозиторий все логически законченные действия. Например, после добавления справочника контактных лиц и его настройки - сделайте коммит. После вывода поля на формы всех документов - сделайте еще один коммит. После добавления поля скидки на форму - сделайте третий коммит, после описания логики работы со скидками - четвертый. Помните, смысл коммитов заключается в том, чтобы Вы могли быстро переключиться к одному из них, по этому имеет смысл делать их достаточно часто, после завершения очередной задачи, отдельной по своему смыслу. С другой стороны, не стоит делать их слишком часто, чтобы история не была перегружена.
//Подсказка 2
//Вы можете создавать отдельные ветки под каждое задание, для тренировки и практики, но в целом, в данном случае, можно все коммитить непосредственно в master.
//Подсказка 3
//В итоге **Все доработки должны быть помещены в master, и должны быть отправлены в удаленный репозиторий**. По этому, рекомендуем после первого коммита попробовать сразу отправить изменения в репозиторий и проверить, что они там отражены.
//6. В процессе разработки, обращайте внимание на ошибки, которые подсвечивает EDT. Старайтесь, сразу исправлять все замечания.
//Дополнительно
//Напишите в комментарий к работе, Свои ощущения от разработки в EDT: как Вы считаете, насколько проще (или сложнее) работать в EDT. Удобнее ли, когда Вы сразу вилдите нарушения стиля программирования, это вам помогает, или скорее отвлекает? (Данное задание не является обязательным, т.к. EDT - довольно новый инструмент, интересны впечатления от его использования начинающими разработчиками)
//Критерии оценки
//Зачет - выполнены все задания, в выполненных заданиях нет противоречий и нарушения логики.
//На доработку - задание выполнено частично или не выполнено, в логике выполнения заданий есть противоречия, существенные недостатки.
//Все задачи обязательны к выполнению. Пожалуйста, присылайте на проверку все задачи сразу.
//
//Любые вопросы по решению задач задавайте в чате учебной группы.
//
//Примерное время выполнения: 60-240 минут
#КонецОбласти