//настроить представление Контактного лица так, чтобы, если заполнено поле «Действует на основании», оно бы отображалось в представлении Контактного лица.
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
 Поля.Добавить("Наименование");
 Поля.Добавить("ДействуетНаОсновании");
 СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление = СтрШаблон("%1%2",Данные.Наименование,?(ЗначениеЗаполнено(Данные.ДействуетНаОсновании),СтрШаблон("(на основании %1)",Данные.ДействуетНаОсновании),""));     
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
